#+TITLE: A Brief Introduction to Literate Analytics With org-babel
#+URL: http://ul.io/nb/2018/04/30/literate-analytics-with-org-babel/
#+AUTHOR: lujun9972
#+TAGS: raw
#+DATE: [2018年 06月 05日 星期二 14:13:05 CST]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

As an engineer on an analytics and data infrastructure team, I spend
作为一名分析和数据基础设施团队的工程师，我花费了
quite a bit of time exploring and performing ad-hoc analyses of data
花了不少时间来研究和执行数据的特别分析
scattered across SQL databases; Hive and Spark clusters; and blob
分散在SQL数据库中;蜂箱和火花塞;和团
storage. These investigations can be a chore -- a single instance might
存储。这些调查可能是一件苦差事——单个实例就可能
involve a half dozen ETL steps, ad-hoc querying to assess whether data
包括6个ETL步骤，特别查询以评估数据是否
needs to be cleaned, and moving code between a REPL and a program
需要清理，并在REPL和程序之间移动代码
destined for production.
注定要生产。

Once an initial conclusion has been reached, I need to go back and
一旦初步的结论已经达成，我需要回去和
document my process for posterity, remembering exactly what worked along
为子孙后代记录我的过程，准确地记住是什么起了作用
the way. This is a recipe for mistakes and omissions, so why not
的方式。这是一个错误和疏忽的处方，所以为什么不
document as you go?
随走随取?

What I need to do is:
我需要做的是:

1. Log each command
1. 记录每个命令
2. Document what it does and why it's necessary
2. 记录它做了什么，为什么有必要做
3. Execute and examine the results as I go
3.执行并检查结果

=org-mode= and =org-babel= provide an amazing environment for this sort
=org-mode=和=org-babel=为这种类型提供了一个令人惊奇的环境
of polyglot, multi-modal series of tasks. Prose and code can be freely
多语言，多模式的一系列任务。散文和代码可以自由使用
intermingled in a [[https://en.wikipedia.org/wiki/Literate_programming][literate
混杂在一个[[https://en.wikipedia.org/wiki/Literate_programming][读写
programming]] style,
编程]]的风格,
any references used during the process can be cited, and the final
在此过程中使用的任何引用都可以被引用，并且是最终引用
product can be exported into human- or machine-readable formats. If
产品可以导出为人类或机器可读的格式。如果
* Using Remote Resources via TRAMP
*通过TRAMP使用远程资源
:PROPERTIES:
属性:
:CUSTOM_ID: using-remote-resources-via-tramp
:CUSTOM_ID using-remote-resources-via-tramp
:END:
结束:

Since it's rare you'll be interacting exclusively with local resources,
由于你很少只与当地资源互动，
it's quite useful to be able to run commands on other machines. For
能够在其他机器上运行命令非常有用。为
example, we frequently =ssh= into our Hadoop cluster head nodes to
例如，我们经常=ssh=到我们的Hadoop集群头节点
rename, move, or find files in HDFS. Fortunately, =babel= is tightly
在HDFS中重命名、移动或查找文件。幸运的是，=babel=关系紧密
integrated with [[https://www.gnu.org/software/tramp/][TRAMP]].
集成了[[https://www.gnu.org/software/tramp/](流浪汉)]。

The =:dir= property on =src= blocks accepts a TRAMP reference; execution
=:dir= property on =src= blocks接受一个TRAMP引用;执行
of the block will then occur on the remote machine, e.g.:
的块，然后将发生在远程机器上，例如:

#+BEGIN_EXAMPLE
1
2
3
4
5
6
7
8
9
10
#+END_EXAMPLE

#+BEGIN_EXAMPLE
#+BEGIN_SRC sh :dir /ssh:spark: :results output list
hdfs dfs -ls $hdfsPath/ServiceInterface
#+END_SRC

#+RESULTS:
: - Found 5 items
: - drwxrwxrwx+ - ... 0 2018-04-25 17:06 $hdfsPath/ServiceInterface/Delinked
: - drwxrwxrwx+ - ... 0 2018-04-25 16:43 $hdfsPath/ServiceInterface/PartialValidated
: - drwxrwxrwx+ - ... 0 2018-04-23 19:58 $hdfsPath/ServiceInterface/PreValidated
: - drwxrwxrwx+ - ... 0 2018-04-25 21:24 $hdfsPath/ServiceInterface/Unvalidated
#+END_EXAMPLE

If you're going to be executing multiple commands on the same remote
如果要在同一个远程上执行多个命令
machine, you can use the =:session= header arg to keep the connection
，您可以使用=:session= header参数来保持连接
open. See [[https://orgmode.org/manual/session.html][the info page for
开放。参见[[https://orgmode.org/manual/session.html]][信息页
:session]] for details.
详情:会话]]。

